//
// Created by jegorix on 26.04.25.
//

#include "task_operations.h"


void addTask(TaskList* list)
{
    if(list->size >= list->capacity)
    {
        list->capacity += 3;
        list->tasks = realloc(list->tasks, list->capacity * sizeof(Task));
    }

    Task* new_task = &list->tasks[list->size];
    new_task->id = list->size + 1;

    char buffer[256];

  printf("\n╭───────────────────────────────────╮\n");
    printf("│     Введите название задачи:      │\n");
    printf("╰───────────────────────────────────╯\n");
    printf("╰─> ");
    fgets(buffer, 256, stdin);
    buffer[strcspn(buffer, "\n")] = 0;
    new_task->title = strdup(buffer);
    printf("\n");

  printf("\n╭───────────────────────────────────╮\n");
    printf("│     Введите описание задачи:      │\n");
    printf("╰───────────────────────────────────╯\n");
    printf("╰─> ");

    fgets(buffer, 256, stdin);
    buffer[strcspn(buffer, "\n")] = 0;
    new_task->description = strdup(buffer);
    printf("\n");

    printf("\n╭────────────────────────────────────────╮\n");
    printf("│ Введите день выполнения задачи (1-31): │\n");
    printf("╰────────────────────────────────────────╯\n");
    printf("╰─> ");

    int day = execute_verification(1,31);
    new_task->day = day;
    printf("\n");

  printf("\n╭─────────────────────────────────────────╮\n");
    printf("│ Введите месяц выполнения задачи (1-12): │\n");
    printf("╰─────────────────────────────────────────╯\n");
    printf("╰─> ");

    int month = execute_verification(1,12);
    new_task->month = month;
    printf("\n");

  printf("\n╭────────────────────────────────────────╮\n");
    printf("│     Введите год выполнения задачи:     │\n");
    printf("╰────────────────────────────────────────╯\n");
    printf("╰─> ");

    int year = execute_verification(2025, max_limit);
    new_task->year = year;
    printf("\n");

  printf("\n╭────────────────────────────────────────╮\n");
    printf("│ Введите приоритет задачи:              │\n");
    printf("│ (1 - высокий, 2 - средний, 3 - низкий) │\n");
    printf("╰────────────────────────────────────────╯\n");
    printf("╰─> ");

    int priority = execute_verification(1, 3);
    new_task->priority = priority;
    printf("\n");

    new_task->status = 0;
    list->size++;

  printf("\n╔════════════════════════════════════════════╗\n");
    printf("║        Задача успешно добавлена!           ║\n");
    printf("╚════════════════════════════════════════════╝\n");


}


void showTasks(TaskList* list)
{
    if(list->size == 0)
    {
      printf("\n╭────────────────────────────────────────────────────────╮\n");
        printf("│                Нет задач для отображения.              │\n");
        printf("╰────────────────────────────────────────────────────────╯\n");
        return;
    }

    for(int i = 0; i < list->size; i++)
    {
        Task* task = &list->tasks[i];



      printf("\n╭────────────────────────╮\n");
        printf("│     Задача № %-4d      │\n", task->id);
        printf("╰────────────────────────╯\n");


        printf("\n╭────────────────────────╮\n");
        printf("│       Название:        │\n");
        printf("│ %s \n", task->title);
        printf("╰────────────────────────╯\n");


        printf("\n╭────────────────────────────────────────────────────────╮\n");
        printf("│                       Описание:                        │\n");
        printf("│ %s                                                  \n", task->description);
        printf("╰────────────────────────────────────────────────────────╯\n");


      printf("\n╭────────────────────────────────────────────────────────╮\n");
        printf("│                   Срок выполнения до:                  │\n");
        printf("│                        %02d.%02d.%04d \n", task->day, task->month, task->year);
        printf("╰────────────────────────────────────────────────────────╯\n");

        switch(task->priority)
        {
            case 1:
              printf("\n╭────────────────────────────────────────────────────────╮\n");
                printf("│                      Приоритет:                        │\n");
                printf("│                Задача высокой важности                 │\n");
                printf("╰────────────────────────────────────────────────────────╯\n");
                break;

            case 2:
              printf("\n╭────────────────────────────────────────────────────────╮\n");
                printf("│                      Приоритет:                        │\n");
                printf("│                Задача средней важности                 │\n");
                printf("╰────────────────────────────────────────────────────────╯\n");
                break;

            case 3:
              printf("\n╭────────────────────────────────────────────────────────╮\n");
                printf("│                      Приоритет:                        │\n");
                printf("│                Задача низкой важности                  │\n");
                printf("╰────────────────────────────────────────────────────────╯\n");
                break;
        }

        if(task->status)
        {
          printf("\n╭────────────────────────────────────────────────────────╮\n");
            printf("│                      Статус:                           │\n");
            printf("│                  Задача выполнена!                     │\n");
            printf("╰────────────────────────────────────────────────────────╯\n");
        }
        else
        {
          printf("\n╭────────────────────────────────────────────────────────╮\n");
            printf("│                      Статус:                           │\n");
            printf("│                Задача не выполнена!                    │\n");
            printf("╰────────────────────────────────────────────────────────╯\n");
        }
printf("────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────\n");
        printf("\n");

    }



}





